test/mutations/dispatch-parse-range-swapped.patch
diff --git a/skills/implement/scripts/dispatch b/skills/implement/scripts/dispatch
index b52b20b..d912559 100755
--- a/skills/implement/scripts/dispatch
+++ b/skills/implement/scripts/dispatch
@@ -102,7 +102,7 @@ def parse_range(raw):
         die("bad RANGE: %s (want 3 or 2-4)" % raw, 2)
     if first > last:
         die("bad RANGE: %s (want 3 or 2-4)" % raw, 2)
-    return first, last
+    return last, first


 def parse_run_base(text):
