test/mutations/preflight-parallel-fence-not-skipped.patch
diff --git a/skills/implement/scripts/preflight b/skills/implement/scripts/preflight
index 8b45164..e17628f 100755
--- a/skills/implement/scripts/preflight
+++ b/skills/implement/scripts/preflight
@@ -50,8 +50,6 @@ changes_paths() {
       bullet = ""
     }

-    /^```/ { fence = !fence; next }
-    fence { next }

     /^###[ \t]+Phase[ \t]+[0-9]+/ {
       flush()
