test/mutations/worker-add-after-rm-unguarded.patch
diff --git a/skills/implement/scripts/worker b/skills/implement/scripts/worker
index d17b744..f4039f2 100755
--- a/skills/implement/scripts/worker
+++ b/skills/implement/scripts/worker
@@ -116,20 +116,6 @@ cmd_add() {
     exit 1
   fi
 
-  local existing_tip
-  existing_tip="$(git -C "$main_checkout" rev-parse --verify --quiet "refs/heads/$branch")" || true
-  if [ -n "$existing_tip" ]; then
-    if [ "$existing_tip" = "$base_sha" ]; then
-      git -C "$main_checkout" worktree add -q "$path" "$branch"
-      ln -s "$main_checkout/.ai-workflow" "$path/.ai-workflow"
-      print_worker_lines
-      exit 0
-    fi
-    echo "$branch already exists and is not at $base_sha (it is at $existing_tip)" >&2
-    echo "worker never resets or deletes a branch: remove it yourself (git branch -D $branch) if that commit is not needed, or add with a different RANGE" >&2
-    exit 1
-  fi
-
   git -C "$main_checkout" worktree add -q -b "$branch" "$path" "$base_sha"
   ln -s "$main_checkout/.ai-workflow" "$path/.ai-workflow"
   print_worker_lines
